## Introduction to Databases

### SQLite exercises

!pip install tabulate

In [1]:
import os
import sys
import time
import datetime
import numpy as np
import pandas as pd

from tabulate import tabulate

import sqlite3

![Db Schema](Figs/database-model.gif)

### Establishing a connection

In [3]:
conn = sqlite3.connect(os.path.join("SampleDBs",'hr.sqlite'))
cur = conn.cursor()

In [5]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cur.fetchall())

[('countries',), ('regions',), ('locations',), ('departments',), ('jobs',), ('employees',), ('department',), ('job_history',), ('prod_mast',), ('prod_backup',), ('orders',), ('tb1',), ('ESERCICIO1',), ('users',), ('tags',), ('s',), ('r',), ('Emor',), ('MIN_SALARY',), ('employee_data',), ('STUDENT',), ('EMPLOYEE_INCOME',), ('details',)]

In [6]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(tabulate(cur.fetchall()))

---------------
countries
regions
locations
departments
jobs
employees
department
job_history
prod_mast
prod_backup
orders
tb1
ESERCICIO1
users
tags
s
r
Emor
MIN_SALARY
employee_data
STUDENT
EMPLOYEE_INCOME
details
---------------

In [7]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
for res in cur.fetchall():
    print(res)

('countries',)
('regions',)
('locations',)
('departments',)
('jobs',)
('employees',)
('department',)
('job_history',)
('prod_mast',)
('prod_backup',)
('orders',)
('tb1',)
('ESERCICIO1',)
('users',)
('tags',)
('s',)
('r',)
('Emor',)
('MIN_SALARY',)
('employee_data',)
('STUDENT',)
('EMPLOYEE_INCOME',)
('details',)

In [8]:
df = pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", conn)
df.head(10)

          name
0    countries
1      regions
2    locations
3  departments
4         jobs
5    employees
6   department
7  job_history
8    prod_mast
9  prod_backup

### SQL Questions

+ Write a query to display the names (first_name, last_name) using alias name "First Name", "Last Name" on the table "employees"

In [9]:
query_1 = '''SELECT first_name AS "First Name", last_name AS "Last Name" FROM employees'''
cur.execute(query_1)
for c in cur.fetchmany(10):
    print(c)

('Steven', 'King')
('Neena', 'Kochhar')
('Lex', 'De Haan')
('Alexander', 'Hunold')
('Bruce', 'Ernst')
('David', 'Austin')
('Valli', 'Pataballa')
('Diana', 'Lorentz')
('Nancy', 'Greenberg')
('Daniel', 'Faviet')

+ Write a query to get unique department ID on the table "employees"

In [10]:
query_2 = '''SELECT DISTINCT department_id FROM employees'''
cur.execute(query_2)
for c in cur.fetchall():
    print(c)

(90,)
(60,)
(100,)
(30,)
(50,)
(80,)
(0,)
(10,)
(20,)
(40,)
(70,)
(110,)

+ Write a query to get all employee details from the employee table order by first name, descending on the table "employees"

In [11]:
query_3 = '''
SELECT * 
FROM employees 
ORDER BY first_name DESC'''

cur.execute(query_3)
for c in cur.fetchmany(10):
    print(c)

(180, 'Winston', 'Taylor', 'WTAYLOR', '650.507.9876', '1987-09-05', 'SH_CLERK', 3200, 0, 120, 50, None)
(171, 'William', 'Smith', 'WSMITH', '011.44.1343.629268', '1987-08-27', 'SA_REP', 7400, 0.15, 148, 80, None)
(206, 'William', 'Gietz', 'WGIETZ', '515.123.8181', '1987-10-01', 'AC_ACCOUNT', 8300, 1, 205, 110, None)
(195, 'Vance', 'Jones', 'VJONES', '650.501.4876', '1987-09-20', 'SH_CLERK', 2800, 0, 123, 50, None)
(106, 'Valli', 'Pataballa', 'VPATABAL', '590.423.4560', '1987-06-23', 'IT_PROG', 4800, 0, 103, 60, None)
(141, 'Trenna', 'Rajs', 'TRAJS', '650.121.8009', '1987-07-28', 'ST_CLERK', 3500, 0, 124, 50, None)
(190, 'Timothy', 'Gates', 'TGATES', '650.505.3876', '1987-09-15', 'SH_CLERK', 2900, 0, 122, 50, None)
(170, 'Tayler', 'Fox', 'TFOX', '011.44.1343.729268', '1987-08-26', 'SA_REP', 9600, 0.2, 148, 80, None)
(132, 'TJ', 'Olson', 'TJOLSON', '650.124.8234', '1987-07-19', 'ST_CLERK', 2100, 0, 121, 50, None)
(203, 'Susan', 'Mavris', 'SMAVRIS', '515.123.7777', '1987-09-28', 'HR_REP', 6500, 0, 101, 40, None)

+ Write a query to get the names (first_name, last_name), salary, PF of all the employees (PF is calculated as 12% of salary) on the table "employees"

In [12]:
query_4 = '''
SELECT first_name, last_name, salary, salary *.12 AS PF
FROM employees 
'''

cur.execute(query_4)
for c in cur.fetchmany(10):
    print(c)

('Steven', 'King', 24000, 2880.0)
('Neena', 'Kochhar', 17000, 2040.0)
('Lex', 'De Haan', 17000, 2040.0)
('Alexander', 'Hunold', 9000, 1080.0)
('Bruce', 'Ernst', 6000, 720.0)
('David', 'Austin', 4800, 576.0)
('Valli', 'Pataballa', 4800, 576.0)
('Diana', 'Lorentz', 4200, 504.0)
('Nancy', 'Greenberg', 12000, 1440.0)
('Daniel', 'Faviet', 9000, 1080.0)

+ Write a query to get the employee ID, names (first_name, last_name), salary in ascending order of salary on the table "employees"

In [13]:
query_5 = '''
SELECT employee_id, first_name, last_name, salary
FROM employees 
ORDER BY salary ASC
'''

cur.execute(query_5)
for c in cur.fetchmany(10):
    print(c)

(132, 'TJ', 'Olson', 2100)
(128, 'Steven', 'Markle', 2200)
(136, 'Hazel', 'Philtanker', 2200)
(127, 'James', 'Landry', 2400)
(135, 'Ki', 'Gee', 2400)
(119, 'Karen', 'Colmenares', 2500)
(131, 'James', 'Marlow', 2500)
(140, 'Joshua', 'Patel', 2500)
(144, 'Peter', 'Vargas', 2500)
(182, 'Martha', 'Sullivan', 2500)

+ Write a query to get the total salaries payable to employees on the table "employees"

In [14]:
query_6 = '''
SELECT SUM(salary)
FROM employees 
'''

cur.execute(query_6)
for c in cur.fetchone():
    print(c)

691400

+ Write a query to get the maximum and minimum salary from employees table on the table "employees"

In [15]:
query_7 = '''
SELECT MAX(salary), MIN (SALARY)
FROM employees 
'''

cur.execute(query_7)
for c in cur.fetchone():
    print(c)

24000
2100

+ Write a query to get the average salary and number of employees in the employees table on the table "employees"

In [16]:
query_8 = '''
SELECT AVG(salary), COUNT (employee_id)
FROM employees 
'''

cur.execute(query_8)
for c in cur.fetchone():
    print(c)

6461.682242990654
107

+ Write a query to get the number of employees working with the company on the table "employees"

In [17]:
query_9 = '''
SELECT COUNT(*)
FROM employees
'''
    
cur.execute(query_9)
for c in cur.fetchone():
    print(c)

107

+ Write a query to get the number of jobs available in the employees table on the table "employees"

In [18]:
query_10 = '''
SELECT COUNT (DISTINCT job_id)
FROM employees
'''
    
cur.execute(query_10)
for c in cur.fetchone():
    print(c)

19

+ Write a query to get all first name from employees table in upper case on the table "employees"

In [19]:
query_11 = '''
SELECT UPPER(first_name)
FROM employees
'''
    
cur.execute(query_11)
for c in cur.fetchmany(10):
    print(c)

('STEVEN',)
('NEENA',)
('LEX',)
('ALEXANDER',)
('BRUCE',)
('DAVID',)
('VALLI',)
('DIANA',)
('NANCY',)
('DANIEL',)

+ Write a query to get the first 3 characters of first name from employees table on the table "employees"

In [20]:
query_12 = '''
SELECT SUBSTR (first_name,1,3)
FROM employees
'''
    
cur.execute(query_12)
for c in cur.fetchmany(10):
    print(c)

('Ste',)
('Nee',)
('Lex',)
('Ale',)
('Bru',)
('Dav',)
('Val',)
('Dia',)
('Nan',)
('Dan',)

+ Write a query to calculate 171*214+625.

In [21]:
query_13 = '''
 SELECT 171*214+625
'''
    
cur.execute(query_13)
for c in cur.fetchone():
    print(c)

37219

+ Write a query to get the names (for example Ellen Abel, Sundar Ande etc.) of all the employees from employees table

In [22]:
query_14 = '''
SELECT first_name || ' ' || last_name
FROM employees
'''
    
cur.execute(query_14)
for c in cur.fetchmany(10):
    print(c)

('Steven King',)
('Neena Kochhar',)
('Lex De Haan',)
('Alexander Hunold',)
('Bruce Ernst',)
('David Austin',)
('Valli Pataballa',)
('Diana Lorentz',)
('Nancy Greenberg',)
('Daniel Faviet',)

+ Write a query to get first name from employees table after removing white spaces from both sides on the table "employees"

In [23]:
query_15 = '''
SELECT trim (first_name)
FROM employees
'''
    
cur.execute(query_15)
for c in cur.fetchmany(10):
    print(c)

('Steven',)
('Neena',)
('Lex',)
('Alexander',)
('Bruce',)
('David',)
('Valli',)
('Diana',)
('Nancy',)
('Daniel',)

+ Write a query to get the length of the employee names (first_name, last_name) from employees table on the table "employees"

In [24]:
query_16 = '''
SELECT length(first_name || last_name)
FROM employees
'''
    
cur.execute(query_16)
for c in cur.fetchmany(10):
    print(c)

(10,)
(12,)
(10,)
(15,)
(10,)
(11,)
(14,)
(12,)
(14,)
(12,)

+ Write a query to select first 10 records from a table on the table "employees"

In [25]:
query_17 = '''
SELECT *
FROM employees
LIMIT 10
'''
    
cur.execute(query_17)
for c in cur.fetchmany(12):
    print(c)

(100, 'Steven', 'King', 'SKING', '515.123.4567', '1987-06-17', 'AD_PRES', 24000, 0, 0, 90, None)
(101, 'Neena', 'Kochhar', 'NKOCHHAR', '515.123.4568', '1987-06-18', 'AD_VP', 17000, 0, 100, 90, None)
(102, 'Lex', 'De Haan', 'LDEHAAN', '515.123.4569', '1987-06-19', 'AD_VP', 17000, 0, 100, 90, None)
(103, 'Alexander', 'Hunold', 'AHUNOLD', '590.423.4567', '1987-06-20', 'IT_PROG', 9000, 0, 102, 60, None)
(104, 'Bruce', 'Ernst', 'BERNST', '590.423.4568', '1987-06-21', 'IT_PROG', 6000, 0, 103, 60, None)
(105, 'David', 'Austin', 'DAUSTIN', '590.423.4569', '1987-06-22', 'IT_PROG', 4800, 0, 103, 60, None)
(106, 'Valli', 'Pataballa', 'VPATABAL', '590.423.4560', '1987-06-23', 'IT_PROG', 4800, 0, 103, 60, None)
(107, 'Diana', 'Lorentz', 'DLORENTZ', '590.423.5567', '1987-06-24', 'IT_PROG', 4200, 0, 103, 60, None)
(108, 'Nancy', 'Greenberg', 'NGREENBE', '515.124.4569', '1987-06-25', 'FI_MGR', 12000, 0, 101, 100, None)
(109, 'Daniel', 'Faviet', 'DFAVIET', '515.124.4169', '1987-06-26', 'FI_ACCOUNT', 9000, 0, 108, 100, None)

+ Write a query to get monthly salary (round 2 decimal places) of each and every employee? - on the table "employees"  
Note : Assume the salary field provides the 'annual salary' information.

In [26]:
query_18 = '''
SELECT round(salary *2/12,2)
FROM employees
'''
    
cur.execute(query_18)
for c in cur.fetchmany(10):
    print(c)

(4000.0,)
(2833.0,)
(2833.0,)
(1500.0,)
(1000.0,)
(800.0,)
(800.0,)
(700.0,)
(2000.0,)
(1500.0,)

+ Write a query to display the names (first_name, last_name) and salary for all employees whose salary is not in the range $10,000 through $15,000 on the table "employees"

In [27]:
query_19 = '''
SELECT first_name, last_name, salary
FROM employees
WHERE salary NOT BETWEEN 10000 AND 15000
'''
    
cur.execute(query_19)
for c in cur.fetchmany(10):
    print(c)

('Steven', 'King', 24000)
('Neena', 'Kochhar', 17000)
('Lex', 'De Haan', 17000)
('Alexander', 'Hunold', 9000)
('Bruce', 'Ernst', 6000)
('David', 'Austin', 4800)
('Valli', 'Pataballa', 4800)
('Diana', 'Lorentz', 4200)
('Daniel', 'Faviet', 9000)
('John', 'Chen', 8200)

+ Write a query to display the names (first_name, last_name) and department ID of all employees in departments 30 or 100 in ascending alphabetical order by department ID on the table "employees"

In [28]:
query_20 = '''
SELECT first_name, last_name, department_id
FROM employees
WHERE department_id = 30 OR department_id = 100
ORDER BY department_id ASC
'''
    
cur.execute(query_20)
for c in cur.fetchall():
    print(c)

('Den', 'Raphaely', 30)
('Alexander', 'Khoo', 30)
('Shelli', 'Baida', 30)
('Sigal', 'Tobias', 30)
('Guy', 'Himuro', 30)
('Karen', 'Colmenares', 30)
('Nancy', 'Greenberg', 100)
('Daniel', 'Faviet', 100)
('John', 'Chen', 100)
('Ismael', 'Sciarra', 100)
('Jose Manuel', 'Urman', 100)
('Luis', 'Popp', 100)

+ Write a query to display the names (first_name, last_name) and salary for all employees whose salary is not in the range $10,000 through $15,000 and are in department 30 or 100 on the table "employees"

In [29]:
query_21 = '''
SELECT first_name, last_name, salary
FROM employees
WHERE (department_id = 30 OR department_id = 100) 
AND (salary NOT BETWEEN 10000 AND 15000)
'''
    
cur.execute(query_21)
for c in cur.fetchall():
    print(c)

('Daniel', 'Faviet', 9000)
('John', 'Chen', 8200)
('Ismael', 'Sciarra', 7700)
('Jose Manuel', 'Urman', 7800)
('Luis', 'Popp', 6900)
('Alexander', 'Khoo', 3100)
('Shelli', 'Baida', 2900)
('Sigal', 'Tobias', 2800)
('Guy', 'Himuro', 2600)
('Karen', 'Colmenares', 2500)

+ Write a query to display the first_name of all employees who have both an "b" and "c" in their first name. on the table "employees"

In [30]:
query_22 = '''
SELECT first_name
FROM employees
WHERE first_name LIKE '%b%' 
AND first_name LIKE '%c%'
'''
    
cur.execute(query_22)
for c in cur.fetchall():
    print(c)

('Bruce',)

+ Write a query to display the last name, job, and salary for all employees whose job is that of a Programmer or a Shipping Clerk, and whose salary is not equal to $4,500, $10,000, or $15,000 on the table "employees"

In [31]:
query_23 = '''
SELECT last_name, job_id, salary
FROM employees
WHERE job_id IN
(SELECT job_id
FROM jobs
WHERE job_title = 'Programmer' OR job_title = 'Shipping Clerk')
AND salary NOT IN (4500,10000,15000)
'''
    
cur.execute(query_23)
for c in cur.fetchall():
    print(c)

('Hunold', 'IT_PROG', 9000)
('Ernst', 'IT_PROG', 6000)
('Austin', 'IT_PROG', 4800)
('Pataballa', 'IT_PROG', 4800)
('Lorentz', 'IT_PROG', 4200)
('Taylor', 'SH_CLERK', 3200)
('Fleaur', 'SH_CLERK', 3100)
('Sullivan', 'SH_CLERK', 2500)
('Geoni', 'SH_CLERK', 2800)
('Sarchand', 'SH_CLERK', 4200)
('Bull', 'SH_CLERK', 4100)
('Dellinger', 'SH_CLERK', 3400)
('Cabrio', 'SH_CLERK', 3000)
('Chung', 'SH_CLERK', 3800)
('Dilly', 'SH_CLERK', 3600)
('Gates', 'SH_CLERK', 2900)
('Perkins', 'SH_CLERK', 2500)
('Bell', 'SH_CLERK', 4000)
('Everett', 'SH_CLERK', 3900)
('McCain', 'SH_CLERK', 3200)
('Jones', 'SH_CLERK', 2800)
('Walsh', 'SH_CLERK', 3100)
('Feeney', 'SH_CLERK', 3000)
('OConnell', 'SH_CLERK', 2600)
('Grant', 'SH_CLERK', 2600)

+ Write a query to display the last names of employees whose names have exactly 6 characters on the table "employees"

In [32]:
query_24 = '''
SELECT last_name
FROM employees
WHERE length(last_name)=6
'''
    
cur.execute(query_24)
for c in cur.fetchmany(10):
    print(c)

('Hunold',)
('Austin',)
('Faviet',)
('Tobias',)
('Himuro',)
('Landry',)
('Markle',)
('Bissot',)
('Marlow',)
('Mallin',)

+ Write a query to display the last names of employees having 'e' as the third character on the table "employees"

In [33]:
query_25 = '''
SELECT last_name
FROM employees
WHERE last_name LIKE '__e%'
'''
    
cur.execute(query_25)
for c in cur.fetchall():
    print(c)

('Greenberg',)
('Chen',)
('Gee',)
('McEwen',)
('Greene',)
('Lee',)
('Ozer',)
('Abel',)
('Fleaur',)
('Everett',)
('Feeney',)
('Baer',)
('Gietz',)

+ Write a query to display the jobs/designations available in the employees table on the table "employees"

In [34]:
query_26 = '''
SELECT DISTINCT job_id
FROM employees
'''
    
cur.execute(query_26)
for c in cur.fetchall():
    print(c)

('AD_PRES',)
('AD_VP',)
('IT_PROG',)
('FI_MGR',)
('FI_ACCOUNT',)
('PU_MAN',)
('PU_CLERK',)
('ST_MAN',)
('ST_CLERK',)
('SA_MAN',)
('SA_REP',)
('SH_CLERK',)
('AD_ASST',)
('MK_MAN',)
('MK_REP',)
('HR_REP',)
('PR_REP',)
('AC_MGR',)
('AC_ACCOUNT',)

+ Write a query to display the names (first_name, last_name), salary and PF (15% of salary) of all employees on the table "employees"

In [35]:
query_27 = '''
SELECT first_name, last_name, salary, salary *.15 AS PF
FROM employees
'''
    
cur.execute(query_27)
for c in cur.fetchmany(10):
    print(c)

('Steven', 'King', 24000, 3600.0)
('Neena', 'Kochhar', 17000, 2550.0)
('Lex', 'De Haan', 17000, 2550.0)
('Alexander', 'Hunold', 9000, 1350.0)
('Bruce', 'Ernst', 6000, 900.0)
('David', 'Austin', 4800, 720.0)
('Valli', 'Pataballa', 4800, 720.0)
('Diana', 'Lorentz', 4200, 630.0)
('Nancy', 'Greenberg', 12000, 1800.0)
('Daniel', 'Faviet', 9000, 1350.0)

+ Write a query to list the number of jobs available in the employees table.

In [36]:
query_28 = '''
SELECT  COUNT(DISTINCT job_id)
FROM employees
'''
    
cur.execute(query_28)
for c in cur.fetchone():
    print(c)

19

+ Write a query to get the total salaries payable to employees.

In [37]:
query_29 = '''
SELECT  SUM (salary)
FROM employees
'''
    
cur.execute(query_29)
for c in cur.fetchone():
    print(c)

691400

+ Write a query to get the minimum salary from employees table.

In [38]:
query_30 = '''
SELECT  MIN (salary)
FROM employees
'''
    
cur.execute(query_30)
for c in cur.fetchone():
    print(c)

2100

+ Write a query to get the maximum salary of an employee working as a Programmer.

In [39]:
query_31 = '''
SELECT  MAX (salary)
FROM employees
WHERE job_id = 
(SELECT job_id
FROM jobs
WHERE job_title = 'Programmer')
'''
    
cur.execute(query_31)
for c in cur.fetchone():
    print(c)

9000

+ Write a query to get the average salary and number of employees working the department 90.

In [40]:
query_32 = '''
SELECT  AVG (salary), COUNT (employee_id)
FROM employees
WHERE department_id = 90
'''
    
cur.execute(query_32)
for c in cur.fetchall():
    print(c)

(19333.333333333332, 3)

+ Write a query to get the highest, lowest, sum, and average salary of all employees.

In [41]:
query_33 = '''
SELECT  MAX (salary), MIN (salary), SUM (salary), AVG(salary)
FROM employees
'''
    
cur.execute(query_33)
for c in cur.fetchone():
    print(c)

24000
2100
691400
6461.682242990654

+ Write a query to get the number of employees with the same job.

In [42]:
query_34 = '''
SELECT  COUNT(employee_id)
FROM employees
GROUP BY job_id
'''
    
cur.execute(query_34)
for c in cur.fetchall():
    print(c)

(1,)
(1,)
(1,)
(1,)
(2,)
(5,)
(1,)
(1,)
(5,)
(1,)
(1,)
(1,)
(5,)
(1,)
(5,)
(30,)
(20,)
(20,)
(5,)

+ Write a query to get the difference between the highest and lowest salaries.

In [43]:
query_35 = '''
SELECT  (MAX(salary)-MIN(salary))
FROM employees
'''
    
cur.execute(query_35)
for c in cur.fetchone():
    print(c)

21900

+ Write a query to find the manager ID and the salary of the lowest-paid employee for that manager.

In [44]:
query_36 = '''
SELECT  manager_id, MIN(salary)
FROM employees
GROUP BY manager_id
'''
    
cur.execute(query_36)
for c in cur.fetchall():
    print(c)

(0, 24000)
(100, 5800)
(101, 4400)
(102, 9000)
(103, 4200)
(108, 6900)
(114, 2500)
(120, 2200)
(121, 2100)
(122, 2200)
(123, 2500)
(124, 2500)
(145, 7000)
(146, 7000)
(147, 6200)
(148, 6100)
(149, 6200)
(201, 6000)
(205, 8300)

+ Write a query to get the department ID and the total salary payable in each department.

In [45]:
query_37 = '''
SELECT  department_id, SUM(salary)
FROM employees
GROUP BY department_id
'''
    
cur.execute(query_37)
for c in cur.fetchall():
    print(c)

(0, 7000)
(10, 4400)
(20, 19000)
(30, 24900)
(40, 6500)
(50, 156400)
(60, 28800)
(70, 10000)
(80, 304500)
(90, 58000)
(100, 51600)
(110, 20300)

+ Write a query to get the average salary for each job ID excluding programmer.

+ Write a query to get the total salary, maximum, minimum, average salary of employees (job ID wise), for department ID 90 only.

+ Write a query to get the job ID and maximum salary of the employees where maximum salary is greater than or equal to $4000.

+ Write a query to get the average salary for all departments employing more than 10 employees.

+ Write a query to find the names (first_name, last_name) and salaries of the employees who have a higher salary than the employee whose last_name='Bull'.

+ Write a query to find the names (first_name, last_name) of all employees who works in the IT department.

+ Write a query to find the names (first_name, last_name) of the employees who have a manager who works for a department based in the United States. Hint : Write single-row and multiple-row subqueries

+ Write a query to find the names (first_name, last_name) of the employees who are managers.

+ Write a query to find the names (first_name, last_name), the salary of the employees whose salary is greater than the average salary.

+ Write a query to find the names (first_name, last_name), the salary of the employees whose salary is equal to the minimum salary for their job grade.

+ Write a query to find the names (first_name, last_name), the salary of the employees who earn more than the average salary and who works in any of the IT departments.

+ Write a query to find the names (first_name, last_name), the salary of the employees who earn more than Mr. Bell.

+ Write a query to find the names (first_name, last_name), the salary of the employees who earn the same salary as the minimum salary for all departments.

+ Write a query to find the names (first_name, last_name) of the employees who are not supervisors.

+ Write a query to display the employee ID, first name, last names, salary of all employees whose salary is above average for their departments.

+ Write a query to find the 5th maximum salary in the employees table.

+ Write a query to find the 4th minimum salary in the employees table.

+ Write a query to select last 10 records from a table.

+ Write a query to list department number, name for all the departments in which there are no employees in the department.

+ Write a query to find the addresses (location_id, street_address, city, state_province, country_name) of all the departments.

+ Write a query to find the names (first_name, last name), department ID and the name of all the employees.

+ Write a query to find the employee id, name (last_name) along with their manager_id, manager name (last_name).

+ Write a query to find the names (first_name, last_name) and hire date of the employees who were hired after 'Jones'.

+ Write a query to get the department name and number of employees in the department.

+ Write a query to find the employee ID, job title number of days between ending date and starting date for all jobs in department 90 from job history.

+ Write a query to display the department ID, department name, and manager first name.

+ Write a query to display the department name, manager name, and city.

+ Write a query to display the job title and average salary of employees.

+ Write a query to to display job title, employee name, and the difference between the salary of the employee and minimum salary for the job.

+ Write a query to display the job history that was done by any employee who is currently drawing more than 10000 of salary.